# FoCS Project 2019/ - Matteo Licciardello mat. 799368

### Import libraries and data

In [2]:
import pandas as pd
import numpy as np
pd.set_option('display.max_columns', 500)

In [2]:
loans_lenders = pd.read_csv('C:/Users/matal/Desktop/loans_lenders.csv')

In [163]:
loans_lenders.head()

   loan_id                                            lenders
0   483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1   483738  muc888, nora3555, williammanashi, barbara5610,...
2   485000  muc888, terrystl, richardandsusan8352, sherri4...
3   486087  muc888, james5068, rudi5955, daniel9859, don92...
4   534428  muc888, niki3008, teresa9174, mike4896, david7...

### 1) Normalize the loan_lenders table. In the normalized table, each row must have one loan_id and one lender

In [166]:
#Conversione lenders in lista di elementi

tmp = loans_lenders.lenders.str.split(", ")
loans_lenders['lenders'] = tmp
loans_lenders

         loan_id                                            lenders
0         483693  [muc888, sam4326, camaran3922, lachheb1865, re...
1         483738  [muc888, nora3555, williammanashi, barbara5610...
2         485000  [muc888, terrystl, richardandsusan8352, sherri...
3         486087  [muc888, james5068, rudi5955, daniel9859, don9...
4         534428  [muc888, niki3008, teresa9174, mike4896, david...
...          ...                                                ...
1387427   678999  [michael43411218, carol5987, gooddogg1, chris4...
1387428  1207353  [rjhoward1986, jeffrey6870, trolltech4460, ely...
1387429  1206220  [vicky7746, gooddogg1, fairspirit, craig972996...
1387430  1206425  [rich6705, sergiiy9766, angela7509, barbara561...
1387431  1206486                            [alan5175, amy38101311]

[1387432 rows x 2 columns]

In [169]:
## Creazione Dataframe con ogni riga corrispondente ad un lender

loans_lenders = loans_lenders.explode('lenders')
pd.DataFrame(loans_lenders)
loans_lenders

In [3]:
## Dump dataframe
#loans_lenders.to_csv('C:/Users/matal/Desktop/loans_lenders_1.csv', index=False)
## Read dataframe
loans_lenders = pd.read_csv('C:/Users/matal/Desktop/loans_lenders_1.csv')
loans_lenders

          loan_id            lenders
0          483693             muc888
1          483693            sam4326
2          483693        camaran3922
3          483693        lachheb1865
4          483693        rebecca3499
...           ...                ...
28293926  1206425  trogdorfamily7622
28293927  1206425          danny6470
28293928  1206425            don6118
28293929  1206486           alan5175
28293930  1206486        amy38101311

[28293931 rows x 2 columns]

### 2) For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing

In [5]:
loans = pd.read_csv('C:/Users/matal/Desktop/loans.csv')
loans.head()

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1,PHP,126.0,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1,HNL,201.0,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1,PKR,245.0,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1,KGS,171.0,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1,PHP,123.0,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner

In [6]:
loans.planned_expiration_time

0          2014-02-14 03:30:06.000 +0000
1          2014-03-26 22:25:07.000 +0000
2          2014-02-15 21:10:05.000 +0000
3          2014-02-21 03:10:02.000 +0000
4          2014-02-13 06:10:02.000 +0000
                       ...
1419602    2016-01-02 01:00:03.000 +0000
1419603    2016-01-02 16:40:07.000 +0000
1419604    2016-01-03 22:20:04.000 +0000
1419605    2016-01-05 08:50:02.000 +0000
1419606    2016-01-03 20:50:06.000 +0000
Name: planned_expiration_time, Length: 1419607, dtype: object

In [7]:
loans.disburse_time

0          2013-12-22 08:00:00.000 +0000
1          2013-12-20 08:00:00.000 +0000
2          2014-01-09 08:00:00.000 +0000
3          2014-01-17 08:00:00.000 +0000
4          2013-12-17 08:00:00.000 +0000
                       ...
1419602    2015-11-23 08:00:00.000 +0000
1419603    2015-11-24 08:00:00.000 +0000
1419604    2015-11-13 08:00:00.000 +0000
1419605    2015-11-03 08:00:00.000 +0000
1419606    2015-11-03 08:00:00.000 +0000
Name: disburse_time, Length: 1419607, dtype: object

In [8]:
## Si valuta la presenza di valori nulli nelle due colonne di valori

print(loans.planned_expiration_time.isna().sum(), loans.disburse_time.isna().sum())

371834 2813

In [9]:
print(type(loans.planned_expiration_time), type(loans.disburse_time))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

In [10]:
## I valori vengono forniti in formato stringa
## Necessario convertire in date-time per poter effettuare l'operazione di differenza temporale richiesta
## L'operazione non viene effettuata per i valori nulli

loans['planned_expiration_time'] = pd.to_datetime(loans['planned_expiration_time'])
loans['disburse_time'] = pd.to_datetime(loans['disburse_time'])

In [11]:
## Creazione dell'attributo "duration" che indica la durata del prestito

loans['duration'] = loans['planned_expiration_time'] - loans['disburse_time']

In [12]:
## Il numero di valori nulli ottenuto è dato dalla somma dei valori nulli dei due attributi
## In questo caso non corrisponde perfettamente perché due record hanno entrambi valori nulli
## A questi viene lasciato il valore nullo già assegnato

print(loans.duration.isna().sum())

374645

In [13]:
## Il nuovo attributo si trova nell'ultima colonna del dataframe

loans.head()

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model,duration
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1,PHP,126.0,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06+00:00,2013-12-22 08:00:00+00:00,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner,53 days 19:30:06
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1,HNL,201.0,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07+00:00,2013-12-20 08:00:00+00:00,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner,96 days 14:25:07
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1,PKR,245.0,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05+00:00,2014-01-09 08:00:00+00:00,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner,37 days 13:10:05
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1,KGS,171.0,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02+00:00,2014-01-17 08:00:00+00:00,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner,34 days 19:10:02
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1,PHP,123.0,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02+00:00,2013-12-17 08:00:00+00:00,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner,57 days 22:10:02

In [4]:
## Dump dataframe
#loans.to_csv('C:/Users/matal/Desktop/loans_1.csv', index=False)
## Read dataframe
loans = pd.read_csv('C:/Users/matal/Desktop/loans_1.csv')

In [4]:
loans.head()

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model,duration
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1,PHP,126.0,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06+00:00,2013-12-22 08:00:00+00:00,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner,53 days 19:30:06.000000000
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1,HNL,201.0,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07+00:00,2013-12-20 08:00:00+00:00,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner,96 days 14:25:07.000000000
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1,PKR,245.0,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05+00:00,2014-01-09 08:00:00+00:00,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner,37 days 13:10:05.000000000
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1,KGS,171.0,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02+00:00,2014-01-17 08:00:00+00:00,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner,34 days 19:10:02.000000000
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1,PHP,123.0,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02+00:00,2013-12-17 08:00:00+00:00,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner,57 days 22:10:02.000000000

### 3) Find the lenders that have funded at least twice

In [18]:
## Conto il numero di volte che un lenders ha finanziato selezionando solo quelli che hanno partecipato a più di un finanziamento
## Sono presenti circa 9000 duplicati, quindi persone che partecipano allo stesso finanziamento in più fasi
## Queste vengono considerate così come sono

twice = loans_lenders.groupby(by='lenders', axis=0).count()
twice = twice[twice.loan_id >= 2]
twice

## Un metodo alternativo altrettanto valido è l'utilizzo della funziona value_counts() di Pandas
#twice = loans_lenders.lenders.value_counts(sort=False)
#twice = twice[twice.values >= 2]

                loan_id
lenders
000                  40
00000                39
0002                 70
0101craign0101       71
0132575               4
...                 ...
zzinnia              28
zzivnk7094            4
zzmcfate           1730
zzrvmf8538           15
zzzsai                4

[901811 rows x 1 columns]

In [23]:
## Dump del dataset con lenders che hanno finanziato almeno 2 volte
## Permette di visionare per intero i valori restituiti

#twice.to_csv('C:/Users/matal/Desktop/twice.csv', index=False)

### 4) For each country, compute how many loans have involved that country as borrowers.

In [74]:
## Per ciascun prestito venogno annotati una serie di valori che identificano il prestito, la nazionalità è uno di questi
## Si procede a contare quante volte ciascuno stato compare nel dataset loans.csv, dopo una verifica dei valori nulli

loans.country_name.isna().sum()

0

In [33]:
## Non si evidenziano valori nulli, si procede ad effettuare il conteggio

involved = loans.groupby(by='country_name', axis=0).loan_id.count()
involved

## Anche in questo caso era possibile procedere utilizzando la value_counts di Pandas nel seguente modo

# involved = loans['country_name'].value_counts()
# involved

country_name
Afghanistan        2337
Albania            3075
Armenia           13952
Azerbaijan        10172
Belize              218
                  ...
Vietnam           21839
Virgin Islands        2
Yemen              4206
Zambia             1277
Zimbabwe           5513
Name: loan_id, Length: 96, dtype: int64

In [34]:
## Dump del dataset che conta in quanti prestiti è coinvolta ciascuna nazione
## Permette di visionare per intero l'elenco dei paesi coinvolti

#involved.to_csv('C:/Users/matal/Desktop/involved.csv', index=False)

### 5) For each country, compute the overall amount of money borrowed.

In [38]:
## Anche in questo caso è necessario raggruppare per stato
## Successivamente si effettua la somma per mezzo della funzione sum() predefinita da Pandas

borrowed = loans.groupby(by='country_name', axis=0).loan_amount.sum()
borrowed

country_name
Afghanistan        1967950.0
Albania            4307350.0
Armenia           22950475.0
Azerbaijan        14784625.0
Belize              150175.0
                     ...
Vietnam           24681100.0
Virgin Islands       10000.0
Yemen              3444000.0
Zambia             1978975.0
Zimbabwe           5851875.0
Name: loan_amount, Length: 96, dtype: float64

In [39]:
## Dump dei dati che rappresentano il totale complessivo dei soldi prestati diviso per nazione
## Permette di visionare per intero l'elenco dei paesi coinvolti

#borrowed.to_csv('C:/Users/matal/Desktop/borrowed.csv', index=False)

### 6) Like the previous point, but expressed as a percentage of the overall amount lent.

In [58]:
## La richiesta è del tutto simile alla precedente, si potrebbero anche non istanziare nuove variabili
## L'operazione viene fatta ugualmente per uniformità, poi si moltiplicano per 100 i prestiti divisi per nazionalità
## Successivamente si divide tutto per il totale dei prestiti, ottenendo le percentuali per ogni stato

borrowed_perc = loans.groupby(by='country_name', axis=0).loan_amount.sum()
tot = loans.loan_amount.sum()

In [59]:
borrowed_perc = borrowed_perc*100/tot
borrowed_perc

country_name
Afghanistan       0.166573
Albania           0.364586
Armenia           1.942589
Azerbaijan        1.251410
Belize            0.012711
                    ...
Vietnam           2.089074
Virgin Islands    0.000846
Yemen             0.291509
Zambia            0.167506
Zimbabwe          0.495318
Name: loan_amount, Length: 96, dtype: float64

In [60]:
## Dump dei dati che rappresentano la percentuale complessiva dei soldi prestati divisa per nazione
## Permette di visionare per intero l'elenco dei paesi coinvolti

#borrowed_perc.to_csv('C:/Users/matal/Desktop/borrowed_perc.csv', index=False)

### 7) Like the three previous points, but split for each year (with respect to disburse time).

In [105]:
## In questo caso viene richiesto di splittare la percentuale anche per ogni anno, oltre che per nazionalità
## Doppio raggruppamento (nazione, anno) per la percentuale

borrowed_perc_y = loans.groupby(['country_name', loans.disburse_time.dt.year]).loan_amount.sum()
borrowed_perc_y

country_name  disburse_time
Afghanistan   2007.0            194975.0
              2008.0            365375.0
              2009.0            585125.0
              2010.0            563350.0
              2011.0            245125.0
                                 ...
Zimbabwe      2013.0            678525.0
              2014.0           1311575.0
              2015.0            723625.0
              2016.0            788600.0
              2017.0           1237600.0
Name: loan_amount, Length: 748, dtype: float64

In [106]:
## Raggruppamento singolo per anno per calcolare i vari totali

tot = loans.groupby(loans.disburse_time.dt.year).loan_amount.sum()
tot

disburse_time
2005.0       102850.0
2006.0      1376575.0
2007.0     15446525.0
2008.0     39423050.0
2009.0     59689475.0
2010.0     72609150.0
2011.0     93699300.0
2012.0    119977575.0
2013.0    132043925.0
2014.0    152270425.0
2015.0    155835650.0
2016.0    160978375.0
2017.0    166053650.0
2018.0       990025.0
Name: loan_amount, dtype: float64

In [107]:
## Calcolo finale della percentuale, divisa per nazionalità, per tutti gli anni a disposizione

borrowed_perc_y = borrowed_perc_y*100/tot
borrowed_perc_y

country_name  disburse_time
Afghanistan   2007.0           1.262258
              2008.0           0.926806
              2009.0           0.980282
              2010.0           0.775866
              2011.0           0.261608
                                 ...
Zimbabwe      2013.0           0.513863
              2014.0           0.861346
              2015.0           0.464351
              2016.0           0.489879
              2017.0           0.745301
Name: loan_amount, Length: 748, dtype: float64

In [108]:
## Dump dei dati che rappresentano la percentuale complessiva dei soldi prestati divisa per nazione e per anno
## Permette di visionare per intero l'elenco dei paesi coinvolti

borrowed_perc_y.to_csv('C:/Users/matal/Desktop/borrowed_perc_y.csv', index=False)

### 8) For each lender, compute the overall amount of money lent. For each loan that has more than one lender, you must assume that all lenders contributed the same amount.

In [118]:
## Viene richiesto di calcolare il totale dei finanziamenti erogati da ciascun finanziatore
## Necessario unire le informazioni contenute nella tabella loans con quelle contneute nella tabella loans_lenders
## Per avere i riferimenti sul valore di ciascun finanziamento e contare il numero di finanziatore per ogni finanziamento
## Non sono presenti dati sufficienti per stabilire quanto ogni finanziatore ha contribuito ai singoli finanziamenti
## Di conseguenza, in caso di più finanzionatori per un singolo finanziamento, la quota di partecipazione
## viene divisa equamente tra i vari finanziatori, se un finanziatore partecipa in due fasi gli saranno assegnate due quote

In [119]:
## Si eliminano le informazioni non utili alla risposta della domanda per evitare processing dei dati troppo onerosi

df_tmp = loans.drop(['loan_name', 'original_language', 'description',
       'description_translated', 'funded_amount', 'status',
       'activity_name', 'sector_name', 'loan_use', 'country_code',
       'country_name', 'town_name', 'currency_policy',
       'currency_exchange_coverage_rate', 'currency', 'partner_id',
       'posted_time', 'planned_expiration_time', 'disburse_time',
       'raised_time', 'lender_term', 'num_lenders_total',
       'num_journal_entries', 'num_bulk_entries', 'tags', 'borrower_genders',
       'borrower_pictured', 'repayment_interval', 'distribution_model',
       'duration'], axis=1)
df_tmp.head()

   loan_id  loan_amount
0   657307        125.0
1   657259        400.0
2   658010        400.0
3   659347        625.0
4   656933        425.0

In [120]:
## Ordinamento crescente per loan_id ed inserimento di una riga per partecipante

df_tmp = df_tmp.merge(loans_lenders, on='loan_id')
df_tmp.sort_values(by='loan_id', inplace=True)
df_tmp.drop('lenders', axis=1, inplace=True)
df_tmp.head()

          loan_id  loan_amount
6895573        84        500.0
6895572        84        500.0
6895571        84        500.0
16534000       85        500.0
16534001       85        500.0

In [121]:
## Calcolo numero finanziatori per ciascun finanziamento

df_app = df_tmp.loan_id.value_counts(sort=False)
df_app.sort_index(inplace=True)
df_tmp.drop_duplicates(subset='loan_id', inplace=True)
df_app.values

array([3, 2, 3, ..., 1, 1, 1], dtype=int64)

In [122]:
## Calcolo cifre versate per finanziamento per persona

df_tmp['loan_amount_per_person'] = df_tmp.loan_amount / df_app.values
df_tmp = df_tmp.merge(loans_lenders, on='loan_id')
df_tmp

          loan_id  loan_amount  loan_amount_per_person     lenders
0              84        500.0              166.666667        ward
1              84        500.0              166.666667     michael
2              84        500.0              166.666667      brooke
3              85        500.0              250.000000     michael
4              85        500.0              250.000000     patrick
...           ...          ...                     ...         ...
28293907  1444051        225.0              225.000000  lauren1424
28293908  1444053        725.0              725.000000   dario6858
28293909  1444058         25.0               25.000000      el5018
28293910  1444063         50.0               50.000000       pgs67
28293911  1444065         25.0               25.000000      el5018

[28293912 rows x 4 columns]

In [128]:
## Risultati finanziamenti versati per persona

money_per_lenders = df_tmp.groupby('lenders').loan_amount_per_person.sum()
money_per_lenders = pd.DataFrame(money_per_lenders)
money_per_lenders

                loan_amount_per_person
lenders
000                        1764.285078
00000                      1380.693644
0002                       2472.563566
00mike00                     52.631579
0101craign0101             2623.565117
...                                ...
zzmcfate                  66113.226325
zzpaghetti9994               51.020408
zzrvmf8538                  576.978086
zzzsai                      267.667370
zzzworld                     27.522936

[1383799 rows x 1 columns]

In [129]:
## Dump del dataset con i soldi finanziati da ogni lenders
## Permette di visionare per intero i valori restituiti

#money_per_lenders.to_csv('C:/Users/matal/Desktop/money_per_lenders.csv')

### 9) For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed. Since the country of the lender is often unknown, you can assume that the true distribution among the countries is the same as the one computed from the rows where the country is known.

In [197]:
## Il problema parte dalla risoluzione dei valori missing per quanto riguarda la nazionalità dei lenders
## Questo viene risolto con una funzione di probabilità che assegna un valore al dato mancante secondo
## La frequenza con cui compaiono i paesi nei dati non mancanti
## Viene ricaricato anche il dataset relativo ai finanziamenti effettuati per persona perché tornerà utile

lenders = pd.read_csv('C:/Users/matal/Desktop/lenders.csv')
money_per_lenders = pd.read_csv('C:/Users/matal/Desktop/money_per_lenders.csv')

In [198]:
lenders.head()

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,qian3013,Qian,NaN,NaN,NaN,1461300457,NaN,NaN,1.0,NaN,0
1,reena6733,Reena,NaN,NaN,NaN,1461300634,NaN,NaN,9.0,NaN,0
2,mai5982,Mai,NaN,NaN,NaN,1461300853,NaN,NaN,NaN,NaN,0
3,andrew86079135,Andrew,NaN,NaN,NaN,1461301091,NaN,NaN,5.0,Peter Tan,0
4,nguyen6962,Nguyen,NaN,NaN,NaN,1461301154,NaN,NaN,NaN,NaN,0

In [199]:
## Controllo proporzioni

weights = lenders.country_code.value_counts(normalize=True)
weights

US    0.664330
CA    0.076325
GB    0.043097
AU    0.041664
DE    0.017975
        ...
NU    0.000001
MS    0.000001
TF    0.000001
KM    0.000001
GW    0.000001
Name: country_code, Length: 234, dtype: float64

In [200]:
## Funzione di probabilità

lenders.loc[lenders.country_code.isna(), 'country_code'] = np.random.choice(weights.index,
                                                              p=weights.values,
                                                              size=lenders.country_code.isna().sum())
lenders

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,qian3013,Qian,NaN,NaN,US,1461300457,NaN,NaN,1.0,NaN,0
1,reena6733,Reena,NaN,NaN,US,1461300634,NaN,NaN,9.0,NaN,0
2,mai5982,Mai,NaN,NaN,US,1461300853,NaN,NaN,NaN,NaN,0
3,andrew86079135,Andrew,NaN,NaN,US,1461301091,NaN,NaN,5.0,Peter Tan,0
4,nguyen6962,Nguyen,NaN,NaN,US,1461301154,NaN,NaN,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
2349169,janet7309,Janet,NaN,NaN,US,1342097163,NaN,NaN,NaN,NaN,0
2349170,pj4198,NaN,NaN,NaN,US,1342097515,NaN,NaN,NaN,NaN,0
2349171,maria2141,Maria,NaN,NaN,US,1342099723,NaN,NaN,2.0,NaN,0
2349172,simone9846,Simone,NaN,NaN,US,1342100213,NaN,NaN,NaN,NaN,0
2349173,laurie1160,Laurie,Timonium,Maryland,US,1342101767,NaN,NaN,1.0,Verian,0

In [201]:
## Ricontrollo proporzione, tutto ok

lenders.country_code.value_counts(normalize=True)

US    6.644421e-01
CA    7.638430e-02
GB    4.300363e-02
AU    4.166826e-02
DE    1.796334e-02
          ...
TF    1.277045e-06
GW    1.277045e-06
IO    8.513631e-07
MS    4.256815e-07
KM    4.256815e-07
Name: country_code, Length: 234, dtype: float64

In [202]:
## A partire dalla tabella money_per_lenders si associano le nazionalità attingendo dalla tabella lenders appena prodotta

money_per_lenders.rename(columns={'lenders': 'permanent_name'}, inplace=True)
money_per_lenders = money_per_lenders.merge(lenders[['permanent_name', 'country_code']], on='permanent_name')
money_per_lenders

         permanent_name  loan_amount_per_person country_code
0                   000             1764.285078           US
1                 00000             1380.693644           DE
2                  0002             2472.563566           US
3              00mike00               52.631579           CH
4        0101craign0101             2623.565117           US
...                 ...                     ...          ...
1383794        zzmcfate            66113.226325           US
1383795  zzpaghetti9994               51.020408           US
1383796      zzrvmf8538              576.978086           US
1383797          zzzsai              267.667370           US
1383798        zzzworld               27.522936           TC

[1383799 rows x 3 columns]

In [209]:
## Calcolo totale dei finanziamenti effettuati, diviso per nazione

money_lend_per_country = money_per_lenders.groupby(by='country_code').sum()
money_lend_per_country = pd.DataFrame(money_lend_per_country)
money_lend_per_country.rename(columns={'loan_amount_per_person': 'loan_lend'}, inplace=True)
money_lend_per_country

                 loan_lend
country_code
AD            6.702689e+03
AE            2.051425e+06
AF            1.527502e+05
AG            1.022880e+03
AI            6.257469e+02
...                    ...
YE            6.287043e+04
YT            1.616826e+03
ZA            7.769481e+05
ZM            3.813368e+04
ZW            1.683306e+04

[231 rows x 1 columns]

In [210]:
## Calcolo totale dei finanziamenti ottenuti, diviso per nazione

money_borrowed_per_country = loans.groupby(by='country_code').loan_amount.sum()
money_borrowed_per_country = pd.DataFrame(money_borrowed_per_country)
money_borrowed_per_country.rename(columns={'loan_amount': 'loan_borrowed'}, inplace=True)
money_borrowed_per_country

              loan_borrowed
country_code
AF                1967950.0
AL                4307350.0
AM               22950475.0
AZ               14784625.0
BA                 477250.0
...                     ...
XK                3083025.0
YE                3444000.0
ZA                1006525.0
ZM                1978975.0
ZW                5851875.0

[95 rows x 1 columns]

In [216]:
## Differenza finanziamenti effettuati - finanziamenti ottenuti

difference_lend_borrowed = money_lend_per_country.merge(money_borrowed_per_country, on='country_code', how='left')
difference_lend_borrowed.fillna(0, inplace=True)
difference_lend_borrowed['difference'] = difference_lend_borrowed.loan_lend - difference_lend_borrowed.loan_borrowed
difference_lend_borrowed

                 loan_lend  loan_borrowed    difference
country_code
AD            6.702689e+03            0.0  6.702689e+03
AE            2.051425e+06            0.0  2.051425e+06
AF            1.527502e+05      1967950.0 -1.815200e+06
AG            1.022880e+03            0.0  1.022880e+03
AI            6.257469e+02            0.0  6.257469e+02
...                    ...            ...           ...
YE            6.287043e+04      3444000.0 -3.381130e+06
YT            1.616826e+03            0.0  1.616826e+03
ZA            7.769481e+05      1006525.0 -2.295769e+05
ZM            3.813368e+04      1978975.0 -1.940841e+06
ZW            1.683306e+04      5851875.0 -5.835042e+06

[231 rows x 3 columns]

In [217]:
## Dump del dataset contenente il totale dei prestiti effettuati e ricevuti diviso per nazione e la loro differenza
## Permette di visionare per intero i valori restituiti

#difference_lend_borrowed.to_csv('C:/Users/matal/Desktop/difference_lend_borrowed.csv')

### 10) Which country has the highest ratio between the difference computed at the previous point and the population?

### 11) Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?

### 12) For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016, planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04 for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.